<a href="https://colab.research.google.com/github/sabsabb/Python-Pandas/blob/main/Pandas_09.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Membagi Data Frame menjadi dua secara acak**

---

Import Modules

In [1]:
import pandas as pd
import numpy as np

Persiapan Data Frame

In [2]:
n_rows = 10
n_cols = 5

cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,20, size=(n_rows,n_cols)), columns=cols)

df

    A   B   C   D   E
0   6   3   6   3  13
1  19  13   4   2   9
2   2   5   7   3  13
3   8   3  19   2  14
4   5   7   9  14  16
5  17   5   1   4  14
6   5  13   2   9  13
7   9   8   3  18  14
8   8   9   9   3   5
9  17   5   3   9  13

Membagi Data Frame Menjadi Dua Secara Acak Berdasarkan Proporsi Tertentu

In [3]:
df.shape

(10, 5)

In [4]:
proporsi = 0.7
df_1 = df.sample(frac=proporsi)
df_2 = df.drop(df_1.index)

print(f'df_1 shape : {df_1.shape}')
print(f'df_2 shape : {df_2.shape}')

df_1 shape : (7, 5)
df_2 shape : (3, 5)

In [5]:
df_1

    A   B   C  D   E
8   8   9   9  3   5
2   2   5   7  3  13
0   6   3   6  3  13
6   5  13   2  9  13
3   8   3  19  2  14
9  17   5   3  9  13
5  17   5   1  4  14

In [6]:
df_2

    A   B  C   D   E
1  19  13  4   2   9
4   5   7  9  14  16
7   9   8  3  18  14